// Regular Expression (RegEx) - регулярки
/*
  мова пошуку тексту по шаблонам. Засновані на використанні метасимволів.
  Регулярка складається з 2 частин.
    - шаблон пошуку - описуємо що щукаємо
    - прапроці - налаштування / параметри регулярки

    /шаблон/прапроці
*/

/*
  Шаблони:
  /text/ - шукаємо слово

  Метасимволи шаблонів:
    . - будь-який один символ
    \ - екранування спицсимвола (наприклад \.)
    \b - шукає "межу" слова
    \B - шукає місце між 2 сусідніми символами в слові (окрім зовнішніх меж) 
    \n - переход на новий рядок
    \t - табуляція
*/

/*
  [ab1v9] - пошук одного символа з перелічених усередині дужок. (крапка всередені вважається звичайним символом)
  [a-z] - вказання одного символа з діапазону (Юнікод)
  [A-Za-z] - вказання декількох діапазонів одночасно
  [^a-z] - пошук усіх символів окрім тих що в дужках.

  Пошук цифри:
    [0-9]
      \d
  Пошук НЕ цифри:
    [^0-9]
      \D
  Пошук "словесних" сиволів
    [a-zA-Z0-9_]
      \w
  Пошук НЕ "словесних" сиволів
    [^a-zA-Z0-9_]
      \W
  Пошук недрукованих (whitespace) символів:
    [ ]
      \s
  Пошук недрукованих (whitespace) символів:
    [^ ]
      \S
*/

/*
  Квантифікатори - частинка регулярки яка дозволяе сказати скільки разів треба повторити
  частину шаблона, яка іде прямо перед квантифікатором

  [0-9]{3} - пошук трьох чисел
  [0-9]{2,3} - від двох до трьох цифр
  [0-9]{4,} - від чотирьох чисел і до безкінечності
  [0-9]{0,7} - від нуля до семі чисела

  або є або немає:
    X{0,1}
    X?
  від нуля до нескінечності:
    X{0,}
    X*
    .* - будь-яка кількість будь-яких символів
  від 1 до нескінечності:
    X{1,}
    X+
*/

/*
  Знайти ціле число будь-якої довжини

  1   +
  2   +
  3.2 -
  3.  +
  30  +

  [0-9]{1,}
  [0-9]+
  \d+

  [0-9]{1,}\.{0,1}
  [0-9]+\.?

  -{0,1}[0-9]{1,}\.{0,1}
  -?[0-9]+\.?
  -?\d+\.?
*/

/*
  Знайти ім'я користувача англійською мовою

  1ohn  -
  john  -
  John  +
  [A-Z][a-z]{1,128}
  [A-Z][a-z]*
*/
